In [1]:
import pandas as pd

In [3]:
# How to make data frames 
df=pd.DataFrame([11,12,13,14,15])
df

    0
0  11
1  12
2  13
3  14
4  15

In [16]:
df2=pd.DataFrame([11,12,13,14,15],[16,17,18,19,20])
df2

     0
16  11
17  12
18  13
19  14
20  15

In [12]:
# Data frames using dict
df=pd.DataFrame({'name'{['komal','Surbhi','Anmol','Rohit','Hargun','Jannat'],'class':['Btech','Mtech','Bca','bba','Btech','Mca']}) #key is the name of the column and the size of all the columns should be same 
df

     name  class
0   komal  Btech
1  Surbhi  Mtech
2   Anmol    Bca
3   Rohit    bba
4  Hargun  Btech
5  Jannat    Mca

In [11]:
# Column is used to get the column with that name -- syntax -- column=[] column name is list as string

In [15]:
df3=df=pd.DataFrame({'name':['komal','Surbhi','Anmol','Rohit','Hargun','Jannat'],'class':'Btech'})
df3 # ITS NOT NECESSARY TO GIVE LIST , WE CAN ALSO GIVE A SINGLE STRING AS A VALUE FOR WHOLE COLUMN

     name  class
0   komal  Btech
1  Surbhi  Btech
2   Anmol  Btech
3   Rohit  Btech
4  Hargun  Btech
5  Jannat  Btech

In [17]:
df.head() # same as series

     name  class
0   komal  Btech
1  Surbhi  Btech
2   Anmol  Btech
3   Rohit  Btech
4  Hargun  Btech

In [18]:
df.tail() # same as series

     name  class
1  Surbhi  Btech
2   Anmol  Btech
3   Rohit  Btech
4  Hargun  Btech
5  Jannat  Btech

In [22]:
df['name'] # access elements

0     komal
1    Surbhi
2     Anmol
3     Rohit
4    Hargun
5    Jannat
Name: name, dtype: object

In [23]:
df.name # cant access multiple columns with dot but can acess with square

0     komal
1    Surbhi
2     Anmol
3     Rohit
4    Hargun
5    Jannat
Name: name, dtype: object

In [25]:
# CONDITIONS  IN DATA FRAMES

In [26]:
df[df['name']=='Hargun'] # to fetch a value with particular name , and to get output as true or false remove the outside list brackets

     name  class
4  Hargun  Btech

In [30]:
# LOC AND ILOC  # work different from series , it works with rows and columns

In [31]:
df.loc[:,:] # saari rows and saare columns

     name  class
0   komal  Btech
1  Surbhi  Btech
2   Anmol  Btech
3   Rohit  Btech
4  Hargun  Btech
5  Jannat  Btech

In [33]:
df.loc[:,'name'] # saari rows and name aala column

0     komal
1    Surbhi
2     Anmol
3     Rohit
4    Hargun
5    Jannat
Name: name, dtype: object

In [34]:
df.loc[:,['name','class']] # saari rows and do column

     name  class
0   komal  Btech
1  Surbhi  Btech
2   Anmol  Btech
3   Rohit  Btech
4  Hargun  Btech
5  Jannat  Btech

In [36]:
df.loc[:2,['name']] # to make 1D data look like 2D data we use list brackets

     name
0   komal
1  Surbhi
2   Anmol

In [38]:
df.iloc[:2,:] # it works on index ,columns also have index an its sequence

     name  class
0   komal  Btech
1  Surbhi  Btech

In [39]:
df.loc[2,'name']='Vishal' # to update a value 
df

     name  class
0   komal  Btech
1  Surbhi  Btech
2  Vishal  Btech
3   Rohit  Btech
4  Hargun  Btech
5  Jannat  Btech

In [40]:
df.loc[:,'roll no']=12 #if columns does not exists it creates a new column
df

     name  class  roll no
0   komal  Btech       12
1  Surbhi  Btech       12
2  Vishal  Btech       12
3   Rohit  Btech       12
4  Hargun  Btech       12
5  Jannat  Btech       12

In [42]:
# steps of deletion 
df.drop('roll no',axis=1)  # if axis=0 -- it finds from row if axis=1 it finds from column

     name  class
0   komal  Btech
1  Surbhi  Btech
2  Vishal  Btech
3   Rohit  Btech
4  Hargun  Btech
5  Jannat  Btech

In [ ]:
data.loc[:[